cucumber/app/controllers/admin_controller.rb

  def start
    Resque.enqueue(LoggerJob)
    Resque.enqueue(HotCalcJob)
    Resque.enqueue(BroadcastMatchJob)
    Channel.all.each do |ch|
---
SELECT "channels".* FROM "channels"