cucumber/app/controllers/channels_controller.rb

SELECT  "channels".* FROM "channels" WHERE "channels"."title" = ? LIMIT 1  [["title", "sodapoppin"]]
---
  def show
    @channel = Channel.find_by_title(params[:name]) or not_found