cucumber/app/controllers/main_controller.rb

  def index
    @channels = Channel.all.select{|ch| ch.online}
    @slices = Slice.all
---
SELECT "channels".* FROM "channels"
SELECT "slices".* FROM "slices"